{
    "bioHeader": "Software Engineer based in Columbus, OH",
    "bio": "I am an experienced Software Engineer and Android Developer, with previous experience as an athlete, and have a passion for innovation and a strong drive for continuous improvement in all of my endeavors. I have recently finished a course on data structure and algorithms and another on Android development, and I'm looking forward to applying what I have learned so far on my next projects.",
    "contact": [
        {
            "type": "email",
            "value": "hpainhas@hotmail.com"
        },
        {
            "type": "location",
            "value": "Columbus, OH - USA"
        },
        {
            "type": "phone",
            "value": "+1 (614) 301-8600"
        },
        {
            "type": "linkedin",
            "value": "henriquepainhas",
            "url": "https://linkedin.com/in/henriquepainhas"
        },
        {
            "type": "github",
            "value": "HPainhas",
            "url": "https://github.com/HPainhas"
        }
    ],
    "githubUsername": "HPainhas",
    "socialMedia": [
        {
            "name": "LinkedIn",
            "url": "https://linkedin.com/in/henriquepainhas",
            "classname": "linkedin social"
        },
        {
            "name": "GitHub",
            "url": "https://github.com/HPainhas",
            "classname": "github social"
        }
    ],
    "education": {
        "college": "The Ohio State University",
        "city": "Columbus",
        "state": "OH",
        "country": "United States",
        "gpa": "3.28",
        "major": "Computer and Information Sciences",
        "start_date": "August 2015",
        "end_date": "May 2020"
    },
    "workExperience": [
        {
            "name": "eRetailing Associates",
            "position": "Software Engineer / Android Engineer",
            "city": "Columbus",
            "state": "OH",
            "country": "United States",
            "start_date": "May 2019",
            "end_date": "",
            "description": [
                "Designed and developed an in-house Android application for the Zebra MC40 scanners using Java and Android Studio for the front-end, and Perl, SQL, and Firebase for the backend. The application uses different web transactions to help the production team with warehouse management tasks. These tasks involve: assign, locate, identify, pick, put away, receive, transfer, print, among others. The goal is to make the warehouse become paperless, the order workflow more efficient, and inventory 100% accurate.",
                "Communicated directly with employees to gather requirements and to get feedback from the application, as well as their desired additional functionalities."
            ]
        },
        {
            "name": "Vyra",
            "position": "Co-Founder / CTO",
            "city": "Columbus",
            "state": "OH",
            "country": "United States",
            "start_date": "January 2020",
            "end_date": "Decembet 2020",
            "description": [
                "My friends and I attempted to innovate the interviewing process for software engineers. We used React JS for the front-end and Node JS, Express, MySQL, and AWS for the back-end to build a web application that allowed interviewers and interviewees to have a more realistic interview experience. The application included a built-in calendar, dashboard, candidate management tools (favorites, position, etc.), real-time screen share, real-time note-taking, among other features."
            ]
        }
    ],
    "technicalProjects": [
        {
            "name": "Countries App",
            "description": "Basic Android application that covers all the modern Android development patterns in Java. This includes: MVVM architecture, Lifecycle Extensions, Dagger2, RxJava, Retrofit, Glide, and some simple Unit Testing."
        },
        {
            "name": "DevConnector",
            "description": "An in-depth full-stack social network application for developers. The tech stack I used includes Node.js, Express, React, Redux, and MongoDB along with ES6+."
        },
        {
            "name": "Pokemon App",
            "description": "Very very simple React Pokemon application using the latest features of React. It utilizes hooks for state and effects instead of classes, and also basic pagination."
        },
        {
            "name": "Homeowner Buddy",
            "description": "A cross-platform mobile app which interacts directly with the web app. The mobile app allows Habitat Mid-Ohio homeowners to search for a tutorial video on how to solve a particular home issue they might have. My team and I used Xamarin Forms, REST architecture, and C# to implement the app."
        }
    ],
    "developmentSkills": [
        {
            "name": "Android Development",
            "value": 90,
            "icon": "faAndroid"
        },
        {
            "name": "Website Development",
            "value": 75,
            "icon": "faCode"
        },
        {
            "name": "REST API Design",
            "value": 85,
            "icon": "faServer"
        },
        {
            "name": "SQL",
            "value": 85,
            "icon": "faDatabase"
        }
    ],
    "technicalSkills": [
        {
            "name": "JavaScript",
            "color": "#F7DF1E"
        },
        {
            "name": "Java",
            "color": "Orange"
        },
        {
            "name": "Perl",
            "color": "#41446D"
        },
        {
            "name": "SQL",
            "color": "#4479A1"
        },
        {
            "name": "Android",
            "color": "#9FC037"
        },
        {
            "name": "React",
            "color": "#61DBFB"
        },
        {
            "name": "Redux",
            "color": "#7749BD"
        },
        {
            "name": "Git",
            "color": "#F05033"
        },
        {
            "name": "Firebase",
            "color": "#F58410"
        }
    ],
    "intercollegiateAthletics": {
        "name": "Ohio State University DI Varsity Men's Swimming and Diving Team",
        "accolades": [
            "2nd place at Men’s 100y Backstroke at 2019 Big Ten Men’s Swimming and Diving Championships",
            "Recipient of the 2018 Ohio State University Swimming & Diving Carl Wirthwein Award (Most Improved Swimmer)",
            "Placed 6 th in the 100m Butterfly at 2015 FINA World Junior Swimming Championships"
        ]
    },
    "leadershipActivities": [
        {
            "name": "Design, Develop, Deploy Organization (D3)",
            "location": "The Ohio State University",
            "city": "Columbus",
            "state": "OH",
            "date": "Fall 2019",
            "description": "Collaboratively worked on a team to develop a platform that will change the way technical interviews work in the tech world."
        }
    ]
}
